In [ ]:
# Empezamos los ejercicios de pair programming con Pandas. En esta lección hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.
# El objetivo de la clase de hoy será crear unos cuántos DataFrames y Series a través de los siguientes ejercicios:

In [1]:
import pandas as pd
import numpy as np

# ¿Qué diferencia hay entre una Serie y un DataFrame?
Una serie son estructuras de una dimensión mientras que un DataFrame es una estructura de dos dimensiones (tablas).

In [3]:
#Momento de trabajar con Series. Contestad a las siguientes preguntas:
# Crea dos listas:
# Una que se llame "valores" que tenga 7 números aleatorios.


valores=[4,2,5,8,3,1,9]

In [4]:
# Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

indices=["Lunes", "Martes", "Miércoles", "Jueves", "Viernes", "Sábado", "Domingo"]

In [7]:
# A partir de estas dos listas cread una Serie donde la variable "valores" 
# sean los valores de la Serie y la variable indices sean los índices de la Serie.

serie_1=pd.Series(valores,indices)
serie_1

Lunes        4
Martes       2
Miércoles    5
Jueves       8
Viernes      3
Sábado       1
Domingo      9
dtype: int64

In [ ]:
# A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.
# Más informción sobre este método aquí.

In [20]:

diccionario=dict(zip(indices, valores))
    
    
print(diccionario)

{'Lunes': 4, 'Martes': 2, 'Miércoles': 5, 'Jueves': 8, 'Viernes': 3, 'Sábado': 1, 'Domingo': 9}

In [21]:
# Crea una Serie con el diccionario creado en el punto anterior.
serie_diccionario= pd.Series(diccionario)
serie_diccionario

Lunes        4
Martes       2
Miércoles    5
Jueves       8
Viernes      3
Sábado       1
Domingo      9
dtype: int64

In [23]:
# ¿Qué forma tiene esta última Serie?

serie_diccionario.shape

(7,)

In [24]:
# ¿Qué tipo de datos tiene?
serie_diccionario.dtypes

dtype('int64')

In [25]:
# ¿Qué tamaño tiene?

serie_diccionario.size

7

In [26]:
# ¿Cuáles son los índices de la Serie?
serie_diccionario.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

In [27]:
# ¿Y los values?

serie_diccionario.values

array([4, 2, 5, 8, 3, 1, 9])

In [28]:
# Extraed el valor para el índice "lunes"

serie_diccionario["Lunes"]

4

In [31]:
# Extraed el valor para el índice "lunes", "martes" y "miércoles".

serie_diccionario.iloc[:3]

Lunes        4
Martes       2
Miércoles    5
dtype: int64

In [34]:
# Extraed el valor para el índice "lunes" y "domingo".

serie_diccionario.iloc[[0,6]]

Lunes      4
Domingo    9
dtype: int64

In [5]:
# Es el turno de los DataFrames
# Cread un array de dos dimensiones con 4 filas y 3 columnas.

#si se crea de dos dimensiones no se puede convertir luego en un dataframe

array_df= np.random.randint(1,20, (4,3))
array_df

array([[ 2,  8, 15],
       [11, 17, 17],
       [16, 14,  2],
       [ 2, 15,  4]])

In [7]:
# Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

df_array= pd.DataFrame(array_df, columns= ["España", "Francia", "Italia"])
df_array

   España  Francia  Italia
0       2        8      15
1      11       17      17
2      16       14       2
3       2       15       4

In [8]:
# Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:
# df = pd.read_csv("medallas.csv", index_col=["País"])
# 📌 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

df = pd.read_csv("./datos/medallas.csv", index_col=["País"])
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [11]:
# Usando el loc extraed todas las columnas de la fila.
df.loc[:]

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [24]:
# Usando el loc extraed todas las columnas de China e Irán.

df.loc[["China", "Irán"]]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [ ]:
df.loc[["Tue", "Sat"], ["Temperature","Wind"]]

In [ ]:
# Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [25]:
df.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [27]:
# Usando el iloc extraed la información de la India. Devolved todas las columnas.

df.iloc[[5]]

       Unnamed: 0  Oro  Plata  Bronce
País
India           6  154    202     315

In [48]:
# Usando el iloc extraed todas las columnas de los paises que estén en posición impar. 
# La primera que nos tendría que salir es Japón y la última Corea del Norte.

df.iloc[1::2, :]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [50]:
# Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
df.iloc[1::2, 1:]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [ ]:
df.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]

In [67]:
# Contestad a las siguientes preguntas:
# ¿Qué país consiguió más de 200 medallas de oro?

df.loc[(df.Oro>200)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [68]:
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata

df.loc[(df.Oro>200) & (df.Plata>1000)]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

In [69]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

df.loc[(df.Oro>200) | (df.Bronce>700)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [77]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

df_columna=df.drop(["Unnamed: 0"], axis=1)
df_columna

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [78]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

df_columna["Total"]= (df_columna["Oro"]+ df_columna["Plata"]+df_columna["Bronce"])
df_columna

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446